package com.zlk.com;


/**
 * @ zlk
 * @ 2020/3/3 11:07
 */
public class HelloWorld {
//    程序执行的起点
    public static void main(String[] args) {
        System.out.println("HelloWorld!");
    }
}

/*关键字

1）完全小写纯英文字母：
2）
 */

/*
* 标识符命名规范
*
* 类名规范：首字母大写，后面每个单词首字母大写（大驼峰写法）
* 变量名、方法名规范：首字母小写，后面每个单词字母大写（小驼峰写法）
*
*/

/*
* 常量
*
* 1）字符串常量；字符串。
* 2）整数常量：数字，没有小数点； 如：100、50；
* 3）浮点数常量：直接写上的数字，有小数点。如：2.5、-3.14、0.0；
* 4）字符常量：单引号引起来的单个字符，如：'A'、'a'、''中
* 5）布尔常量：只有两种取值；true、false。
* 6）空常量：null；代表没有任务数据
*
* */

